{"data":{"site":{"siteMetadata":{"title":"About web performance and sites with energy low.","author":"Dmitry Schegolihin"}},"markdownRemark":{"id":"55e61c8e-3202-5b5d-9e01-bf0b579fb947","excerpt":"Development the Paypal Module for Vue Storefront Motivation The Vue Storefront - is first PWA for eCommerce. We first met this project in…","html":"<p>Development the Paypal Module for Vue Storefront</p>\n<p>Motivation</p>\n<p>The Vue Storefront - is first PWA for eCommerce. We first met this project in the fall of 2017. We are concerned with the process of accelerating the development of Ecommerce projects for the Magento2 platform in terms of frontend. Magento2 box frontend is technologically outdated (jquery / knockoutjs) and developing a standard Luma theme is taking too much time, especially in terms of Checkout. With the Vue Storefront project, development of the frontend has accelerated several times, since the threshold for entering the Vue / Vuex technology stack is much lower than the threshold for entering the Magento2 frontend stack. The topic is online shopping and develop new modules missing from the box and needed by the business. In this article we want to share the experience of developing the Paypal payment module for the VSF project (Vue Storefront).</p>\n<p>Development</p>\n<p>In the first versions of VSF, you could develop an extension and install it on several projects or use it for several themes within one instance to extend the standard functionality. In addition, it was possible to write extension for the part Api, which is installed from a separate repository. But with this approach, it was not possible to override or inherit kernel modules or theme modules. In the latest release v1.6.0 VSF such an opportunity appeared. The new concept of the modular approach has allowed to change the functionality of any kernel module, giving it custom features. The VSF modular approach is conceptually very similar to Magento2 modules. The developers of the approach draw an analogy with Lego Blocks for a better understanding of the meaning, more <a href=\"https://divanteltd.github.io/vue-storefront/guide/modules/introduction.html\">https://divanteltd.github.io/vue-storefront/guide/modules/introduction.html</a></p>\n<p>So we need to implement the Paypal payment method as a module for VSF. Integration with Paypal can be done in different ways Client Side and Server Side. For more security we using the Server Integration - a Paypal credentionals stored in Api config, more info <a href=\"https://developer.paypal.com/docs/checkout/how-to/server-integration/\">https://developer.paypal.com/docs/checkout/how-to/server-integration/</a></p>\n<p><img src=\"./login.png\" alt=\"Login to Magento2 backend\"></p>\n<p>Out of the box, Paypal provides a JavaScript implementation for interacting with the payment gateway. We will take this script as a starting point for interaction with the Paypal gateway <code class=\"language-text\">https://www.paypalobjects.com/api/checkout.js</code> for frontend part. You need create the PayPal Client IDs . To create a paypal app use link <a href=\"https://developer.paypal.com/developer/applications/create\">https://developer.paypal.com/developer/applications/create</a></p>\n<p>Server part</p>\n<p>Next step - implement two endpoint in you server part on Paypal integration to VSF. Api of VSF have extensions directory is place for this endpoints. Extensions connected automatically and have standart rest endpoint <code class=\"language-text\">/ext/</code> For more info <a href=\"https://github.com/DivanteLtd/vue-storefront-api/blob/f6a546ac1a3b1d5691555ff0530c4f41df775343/src/api/index.js#L59\">https://github.com/DivanteLtd/vue-storefront-api/blob/f6a546ac1a3b1d5691555ff0530c4f41df775343/src/api/index.js#L59</a> you can read this code. For development purposes, Paypal provides a test sandbox gateway <code class=\"language-text\">https://api.sandbox.paypal.com</code></p>\n<p>Client part</p>\n<p>Now let’s configure the client part of the payment module. Each VSF module can contain a standard structure, the only required file for which is <code class=\"language-text\">index.js</code>, an extended module signature:</p>\n<p><img src=\"./login.png\" alt=\"Login to Magento2 backend\"></p>\n<p>From which we can see that there are two hooks <code class=\"language-text\">beforRegistration</code> and <code class=\"language-text\">afterRegistration</code>. We will use the <code class=\"language-text\">beforeRegistration</code> hook to call an action with the addition of a payment method and transfer settings and load the Paypal interaction script:</p>\n<p><img src=\"./login.png\" alt=\"Login to Magento2 backend\"></p>\n<p>The important point here is that we are trying to download the script only to the client side, since the hooks are processed on both the Client Side and Server Side, for this we wrap the check in <code class=\"language-text\">!Vue.prototype.$isServer</code>. Here the code <code class=\"language-text\">vsfpaypal</code> must match the code of the method of payment in Magento2. For these purposes, we implemented a simplified payment method for Magento2 <a href=\"https://github.com/develodesign/m2-paypal-payment\">https://github.com/develodesign/m2-paypal-payment</a></p>\n<p>Next, we will implement the Paypal button component upon clicking on which the standard Paypal pop-up window with the authorization and payment functionality on the gateway will be called. For the button, we use the standard Vue approach, a feature here is only the nuance of the initialization of the Paypal button, for this we use the standard hook <code class=\"language-text\">mounted</code> of the Vue component. This is the moment of the component life cycle when the Dom model is ready for calls, at this very moment we can render the Paypal button using its components:</p>\n<p><img src=\"./login.png\" alt=\"Login to Magento2 backend\"></p>\n<p>To simplify the perception - I have reduced the code. More details can be found here <a href=\"https://github.com/develodesign/vsf-payment-paypal/blob/master/components/Button.vue\">https://github.com/develodesign/vsf-payment-paypal/blob/master/components/Button.vue</a>\nAnother important point is that to interact with Api we will use Vuex actions, in the component calling only dispatchers, for example <code class=\"language-text\">store.dispatch(&#39;paypal/create&#39;, this.getTransactions())</code>. This makes the components Viewer code cleaner..</p>\n<p>To simplify the integration into the topic, it was decided to provide only an example of this integration, with the possibility of replacing the standard Place Order button with the Paypal button, with everything being solved by means of Vue, here’s an example: <a href=\"https://github.com/develodesign/vsf-payment-paypal/blob/master/components/core/blocks/Checkout/OrderReview.vue\">https://github.com/develodesign/vsf-payment-paypal/blob/master/components/core/blocks/Checkout/OrderReview.vue</a></p>\n<p>Let’s sort it out:</p>\n<p><img src=\"./login.png\" alt=\"Login to Magento2 backend\"></p>\n<p>To check for the current selected payment method, we use the property <code class=\"language-text\">this.$store.state.checkout.paymentDetails</code> which we forward into the reactive object <code class=\"language-text\">data</code> and then do the check in the template.</p>\n<p>Criticism</p>\n<p>The modular architecture has given a new round to the development of the Vue Storefront project, but this system needs to be improved. In my opinion, it is necessary to improve the overlap of boxed or custom modules at the theme level, so that the functionality covered in the theme does not affect neighboring themes, like the fallback architecture in Magento2.\nIt lacks the ability to overlap the search library <code class=\"language-text\">core/store/lib/search.ts</code>, namely the function <code class=\"language-text\">quickSearchByQuery</code> for example, extensions in the custom module to the ability to work with multiple ElasticSearch indexes. It would be cool to arrange this functionality in the form of a kernel module, this would allow to easily override the search function. But I figured out how to solve this moment - you can create a separate module based on queries through GraphQL, thus we will hide communication to several indexes or services outside of the GraphQL scheme.</p>\n<p>Conclusion…</p>\n<p>I tried to describe in detail the process of creating modules for the Vue Storefront project, using the Paypal payment method as an example. I will be glad to answer questions and improve this material :)</p>","frontmatter":{"title":"Development the Paypal Module for Vue Storefront","date":"December 16, 2018"}}},"pageContext":{"slug":"/vsf-paypal-module/","previous":{"fields":{"slug":"/redis-clear/"},"frontmatter":{"title":"Clear redis cache from you docker container"}},"next":{"fields":{"slug":"/m2-remove-block-from-admin/"},"frontmatter":{"title":"Remove block via Layout Update XML via Magento2 admin area"}}}}